<%--
  Created by IntelliJ IDEA.
  User: hua'wei
  Date: 2022/11/16
  Time: 16:20
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>

<%
    String message = (String)request.getServletContext().getAttribute("messages");  // 获取当前的聊天记录
    if (message == null) message = "";

    String online = (String)request.getServletContext().getAttribute("online");  // 获取当前在线人数
    if (online == null) online = "0";

    response.setHeader("refresh","4;URL=chat.jsp");
%>

<html>

<head>
    <title>民大聊天室</title>
    <link href="css/chat.css" rel="stylesheet" type="text/css" />
</head>

<body>
<svg t="1668842825628" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9531" width="150" height="150"><path d="M758.982 1014H265.018c-24.95 0-45.176-20.226-45.176-45.176V55.176C219.842 30.226 240.068 10 265.018 10h493.964c24.95 0 45.176 20.226 45.176 45.176v913.65c0 24.948-20.226 45.174-45.176 45.174z" fill="#5861C7" p-id="9532"></path><path d="M758.982 10H265.018c-24.95 0-45.176 20.226-45.176 45.174v40c0-24.95 20.226-45.174 45.176-45.174h493.964c24.95 0 45.176 20.226 45.176 45.174v-40C804.158 30.226 783.932 10 758.982 10z" fill="#8F95E6" p-id="9533"></path><path d="M758.982 974H265.018c-24.95 0-45.176-20.226-45.176-45.174v40c0 24.95 20.226 45.174 45.176 45.174h493.964c24.95 0 45.176-20.226 45.176-45.174v-40c0 24.948-20.226 45.174-45.176 45.174z" fill="#4F56B0" p-id="9534"></path><path d="M738.38 926.81H285.62a13.656 13.656 0 0 1-13.658-13.658V110.848a13.656 13.656 0 0 1 13.658-13.658h452.76a13.656 13.656 0 0 1 13.658 13.658v802.304a13.656 13.656 0 0 1-13.658 13.658z" fill="#D476E2" p-id="9535"></path><path d="M634.844 40.148H389.156a12.3 12.3 0 0 0 0 24.6h245.688a12.3 12.3 0 1 0 0-24.6zM573.702 992.97H450.3c-12.778 0-23.138-10.36-23.138-23.138 0-12.778 10.36-23.138 23.138-23.138h123.402c12.778 0 23.138 10.36 23.138 23.138-0.002 12.78-10.36 23.138-23.138 23.138z" fill="#333399" p-id="9536"></path><path d="M407.998 179.044H55.176C30.226 179.044 10 199.27 10 224.22v242.378c0 24.95 20.226 45.176 45.174 45.176h187.164l120.494 120.494c7.042 7.042 19.08 2.054 19.08-7.904v-112.59h26.084c24.95 0 45.176-20.226 45.176-45.176V224.22c0-24.95-20.226-45.176-45.174-45.176z" fill="#69EBFC" p-id="9537"></path><path d="M185.944 261.596c32.21-0.334 45.312 21.402 45.312 21.402s12.668-21.07 44.878-21.402c32.21-0.334 56.542 26.632 56.802 51.756 0.26 25.122-3.462 43.118-49.826 82.592-16.282 13.862-29.966 23.71-38.932 29.734a20.814 20.814 0 0 1-22.884 0.238c-9.088-5.838-22.974-15.4-39.54-28.92-47.174-38.504-51.268-56.42-51.528-81.542-0.26-25.124 23.508-53.524 55.718-53.858z" fill="#FF8354" p-id="9538"></path><path d="M616.004 428.184h352.822c24.95 0 45.174 20.226 45.174 45.176v242.378c0 24.95-20.226 45.176-45.174 45.176h-187.164l-120.494 120.494c-7.042 7.042-19.08 2.054-19.08-7.904v-112.59h-26.084c-24.95 0-45.176-20.226-45.176-45.176v-242.38c0-24.95 20.226-45.174 45.176-45.174z" fill="#69EBFC" p-id="9539"></path><path d="M925.948 565.28H658.88c-10.83 0-19.61-8.78-19.61-19.61s8.78-19.61 19.61-19.61h267.068c10.83 0 19.61 8.78 19.61 19.61 0 10.832-8.78 19.61-19.61 19.61zM925.948 664.086H658.88c-10.83 0-19.61-8.78-19.61-19.61s8.78-19.61 19.61-19.61h267.068c10.83 0 19.61 8.78 19.61 19.61s-8.78 19.61-19.61 19.61z" fill="#C7FCFE" p-id="9540"></path></svg>
<br>
<div>
    <textarea class="textarea1" name="output"><%=message%></textarea>
</div>

<div>
    <form action="inputa" method="post">
        <textarea class="textarea2" name="input"></textarea>
        <div>
            <input class="button1" type="reset" value="清空">
            <input class="button2" type="submit" value="发送">
        </div>
    </form>
</div>

<div>
    <div class="text">当前在线人数为<%=online%></div>
    <br>
    <br>
    <botton class="link"><a style="text-decoration:none; color:rgb(167, 144, 166)" href="LoginSuccess.jsp">返回系统首页</a></botton>
</div>

</body>

</html>
